
## 字符串

严格地讲, Erlang中并没有字符串, 字符串实际上就是一个整数列表. 用双引号 (") 将一串字符括起来就是一个字符串, 比如, 可以这样写:

```erl
1> Name = "Hello".
"Hello"
```

说明: 在某些编程语言中, 字符串即可以使用单引号也可以使用双引号, 而在Erlang中, 必须使用双引号.

这里的 "Hello" 仅仅是一个速记形式, 实际上它意味着一个整数列表, 列表中每一个元素都是相应字符的整数值.

shell打印一串列表值时, 只有列表中的所有整数都是可打印字符, 它才把这个列表当作字符串来打印:

```erl
2> [1,2,3].
[1,2,3]
3> [83,117,114,112,114,105,115,101].
"Surprise"
4> [1,83,117,114,112,114,105,115,101].
[1,83,117,114,112,114,105,115,101]
```

表达式2的列表[1,2,3]被原封不动地打印出来, 这是因为1,2,3并不是可打印字符.

表达式3的列表中, 所有的项都是可打印字符, 因此列表就打印成字符串的形式.

表达式4与表达式3大体相同, 但列表的开始元素为1, 并非可打印字符, 因此这个列表被原样打印.

无须要死记硬背哪一个整数表示哪一个特定的字符 (ASCII码表), 可以使用$符号来表示字符的整数值. 例如, $a实际上是一个整数, 表示字符a, 比如说:

```erl
5> I = $s.
115
6> [I-32,$u,$r,$p,$r,$i,$s,$e].
"Surprise"
```


